<%@ page contentType="text/html;charset=UTF-8" %>
<html>
<head>
    <title>About</title>
</head>
<body>
<p>
JSP або Java Server Pages — це технологія Java, яка дозволяє створювати динамічні веб-сторінки для програм Java.
</p>
<hr>
<h5>JSP дозволяє розробнику:</h5>
<ul>
    <li>отримувати дані з веб-сторінки Java-код;</li>
    <li>надсилати дані з Java коду на веб-сторінку;</li>
    <li>писати Java-код, прямо всередині html (проте зловживати цим не варто).</li>
</ul>
<hr>
<h5>Необхідність знання JSP можна оцінити досить високо з кількох причин:</h5>
<ul>
    <li>JSP – одна з основних Java web-технологій;</li>
    <li>JSP широко використовується в більшості компаній та проектів;</li>
    <li>JSP безшовно інтегрується з сервлет Java всередині контейнера сервлетів.</li>
</ul>

</body>
</html>
